# """Работа с github"""
# dir - просмотреть список файлов в текущей директории
# cd название_папки - смена директории
# cd .. - выход из папки
# git --version - проверка версии git
# git init -- инициализация репозитория
# git status -- проверка статуса репозитория
# git add <file> -- добавить новый файл либо изменения файла в отслеживаемые
# git commit -m "message" - фиксация изменений (сохранение изменений)
# git restore <file> - восстановление файла, если он был удалён или изменён
# git add . - добавить все файлы в отслеживаемые
# .gitignore - файл, в который записываются все игнорируемые файлы и папки
# git restore . -- восстановление всех файлов
# git log -- посмотр всех коммитов на текущей ветке
# git branch - просмотреть список веток в репозитории
# git branch -m master main -- переименовать ветку master в main
# git branch название_ветки -- создание новой ветки
# git checkout -b "homework/5" -- создание ветки и переход в неё
# git push -u origin main -- запушить (отправить) ветку main (либо любую другую) на удаленный репозиторий origin
